MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4300-F100F256/mcu.h
/* ------------------------------  ECAT_STATION_ADR  ------------------------------ */
#define ECAT_STATION_ADR_NODE_ADDR_Pos        (0UL)                     /*!< ECAT STATION_ADR: NODE_ADDR (Bit 0)                         */
#define ECAT_STATION_ADR_NODE_ADDR_Msk        (0xffffUL)                /*!< ECAT STATION_ADR: NODE_ADDR (Bitfield-Mask: 0xffff)         */

/* -----------------------------  ECAT_STATION_ALIAS  ----------------------------- */
#define ECAT_STATION_ALIAS_ALIAS_ADDR_Pos     (0UL)                     /*!< ECAT STATION_ALIAS: ALIAS_ADDR (Bit 0)                      */
#define ECAT_STATION_ALIAS_ALIAS_ADDR_Msk     (0xffffUL)                /*!< ECAT STATION_ALIAS: ALIAS_ADDR (Bitfield-Mask: 0xffff)      */

/* -----------------------------  ECAT_WR_REG_ENABLE  ----------------------------- */
#define ECAT_WR_REG_ENABLE_WR_REG_EN_Pos      (0UL)                     /*!< ECAT WR_REG_ENABLE: WR_REG_EN (Bit 0)                       */
#define ECAT_WR_REG_ENABLE_WR_REG_EN_Msk      (0x1UL)                   /*!< ECAT WR_REG_ENABLE: WR_REG_EN (Bitfield-Mask: 0x01)         */

/* -----------------------------  ECAT_WR_REG_PROTECT  ---------------------------- */
#define ECAT_WR_REG_PROTECT_WR_REG_P_Pos      (0UL)                     /*!< ECAT WR_REG_PROTECT: WR_REG_P (Bit 0)                       */
#define ECAT_WR_REG_PROTECT_WR_REG_P_Msk      (0x1UL)                   /*!< ECAT WR_REG_PROTECT: WR_REG_P (Bitfield-Mask: 0x01)         */

/* -----------------------------  ECAT_ESC_WR_ENABLE  ----------------------------- */
#define ECAT_ESC_WR_ENABLE_ESC_WR_PROT_Pos    (0UL)                     /*!< ECAT ESC_WR_ENABLE: ESC_WR_PROT (Bit 0)                     */
#define ECAT_ESC_WR_ENABLE_ESC_WR_PROT_Msk    (0x1UL)                   /*!< ECAT ESC_WR_ENABLE: ESC_WR_PROT (Bitfield-Mask: 0x01)       */

/* -----------------------------  ECAT_ESC_WR_PROTECT  ---------------------------- */
#define ECAT_ESC_WR_PROTECT_ESC_WR_PROT_Pos   (0UL)                     /*!< ECAT ESC_WR_PROTECT: ESC_WR_PROT (Bit 0)                    */
#define ECAT_ESC_WR_PROTECT_ESC_WR_PROT_Msk   (0x1UL)                   /*!< ECAT ESC_WR_PROTECT: ESC_WR_PROT (Bitfield-Mask: 0x01)      */

/* -----------------------------  ECAT_ESC_RESET_ECAT  ---------------------------- */
#define ECAT_ESC_RESET_ECAT_RESET_CMD_WRITEMode_Pos (0UL)               /*!< ECAT ESC_RESET_ECAT: RESET_CMD_WRITEMode (Bit 0)            */
#define ECAT_ESC_RESET_ECAT_RESET_CMD_WRITEMode_Msk (0xffUL)            /*!< ECAT ESC_RESET_ECAT: RESET_CMD_WRITEMode (Bitfield-Mask: 0xff) */

/* -----------------------------  ECAT_ESC_RESET_ECAT  ---------------------------- */
#define ECAT_ESC_RESET_ECAT_RESET_CMD_STATE_READMode_Pos (0UL)          /*!< ECAT ESC_RESET_ECAT: RESET_CMD_STATE_READMode (Bit 0)       */
#define ECAT_ESC_RESET_ECAT_RESET_CMD_STATE_READMode_Msk (0x3UL)        /*!< ECAT ESC_RESET_ECAT: RESET_CMD_STATE_READMode (Bitfield-Mask: 0x03) */

/* -----------------------------  ECAT_ESC_RESET_PDI  ----------------------------- */
#define ECAT_ESC_RESET_PDI_RESET_CMD_WRITEMode_Pos (0UL)                /*!< ECAT ESC_RESET_PDI: RESET_CMD_WRITEMode (Bit 0)             */
#define ECAT_ESC_RESET_PDI_RESET_CMD_WRITEMode_Msk (0xffUL)             /*!< ECAT ESC_RESET_PDI: RESET_CMD_WRITEMode (Bitfield-Mask: 0xff) */

/* -----------------------------  ECAT_ESC_RESET_PDI  ----------------------------- */
#define ECAT_ESC_RESET_PDI_RESET_CMD_STATE_READMode_Pos (0UL)           /*!< ECAT ESC_RESET_PDI: RESET_CMD_STATE_READMode (Bit 0)        */
#define ECAT_ESC_RESET_PDI_RESET_CMD_STATE_READMode_Msk (0x3UL)         /*!< ECAT ESC_RESET_PDI: RESET_CMD_STATE_READMode (Bitfield-Mask: 0x03) */

/* -----------------------------  ECAT_ESC_DL_CONTROL  ---------------------------- */
#define ECAT_ESC_DL_CONTROL_FR_Pos            (0UL)                     /*!< ECAT ESC_DL_CONTROL: FR (Bit 0)                             */
#define ECAT_ESC_DL_CONTROL_FR_Msk            (0x1UL)                   /*!< ECAT ESC_DL_CONTROL: FR (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_CONTROL_TEMP_Pos          (1UL)                     /*!< ECAT ESC_DL_CONTROL: TEMP (Bit 1)                           */
#define ECAT_ESC_DL_CONTROL_TEMP_Msk          (0x2UL)                   /*!< ECAT ESC_DL_CONTROL: TEMP (Bitfield-Mask: 0x01)             */
#define ECAT_ESC_DL_CONTROL_LP0_Pos           (8UL)                     /*!< ECAT ESC_DL_CONTROL: LP0 (Bit 8)                            */
#define ECAT_ESC_DL_CONTROL_LP0_Msk           (0x300UL)                 /*!< ECAT ESC_DL_CONTROL: LP0 (Bitfield-Mask: 0x03)              */
#define ECAT_ESC_DL_CONTROL_LP1_Pos           (10UL)                    /*!< ECAT ESC_DL_CONTROL: LP1 (Bit 10)                           */
#define ECAT_ESC_DL_CONTROL_LP1_Msk           (0xc00UL)                 /*!< ECAT ESC_DL_CONTROL: LP1 (Bitfield-Mask: 0x03)              */
#define ECAT_ESC_DL_CONTROL_LP2_Pos           (12UL)                    /*!< ECAT ESC_DL_CONTROL: LP2 (Bit 12)                           */
#define ECAT_ESC_DL_CONTROL_LP2_Msk           (0x3000UL)                /*!< ECAT ESC_DL_CONTROL: LP2 (Bitfield-Mask: 0x03)              */
#define ECAT_ESC_DL_CONTROL_LP3_Pos           (14UL)                    /*!< ECAT ESC_DL_CONTROL: LP3 (Bit 14)                           */
#define ECAT_ESC_DL_CONTROL_LP3_Msk           (0xc000UL)                /*!< ECAT ESC_DL_CONTROL: LP3 (Bitfield-Mask: 0x03)              */
#define ECAT_ESC_DL_CONTROL_RX_FIFO_SIZE_Pos  (16UL)                    /*!< ECAT ESC_DL_CONTROL: RX_FIFO_SIZE (Bit 16)                  */
#define ECAT_ESC_DL_CONTROL_RX_FIFO_SIZE_Msk  (0x70000UL)               /*!< ECAT ESC_DL_CONTROL: RX_FIFO_SIZE (Bitfield-Mask: 0x07)     */
#define ECAT_ESC_DL_CONTROL_LJ_Pos            (19UL)                    /*!< ECAT ESC_DL_CONTROL: LJ (Bit 19)                            */
#define ECAT_ESC_DL_CONTROL_LJ_Msk            (0x80000UL)               /*!< ECAT ESC_DL_CONTROL: LJ (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_CONTROL_RLD_ST_Pos        (22UL)                    /*!< ECAT ESC_DL_CONTROL: RLD_ST (Bit 22)                        */
#define ECAT_ESC_DL_CONTROL_RLD_ST_Msk        (0x400000UL)              /*!< ECAT ESC_DL_CONTROL: RLD_ST (Bitfield-Mask: 0x01)           */
#define ECAT_ESC_DL_CONTROL_S_ALIAS_Pos       (24UL)                    /*!< ECAT ESC_DL_CONTROL: S_ALIAS (Bit 24)                       */
#define ECAT_ESC_DL_CONTROL_S_ALIAS_Msk       (0x1000000UL)             /*!< ECAT ESC_DL_CONTROL: S_ALIAS (Bitfield-Mask: 0x01)          */

