MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4300-F100F256/mcu.h
/* -----------------------------  ECAT_PDI_ERR_COUNT  ----------------------------- */
#define ECAT_PDI_ERR_COUNT_PDI_ERROR_COUNTER_Pos (0UL)                  /*!< ECAT PDI_ERR_COUNT: PDI_ERROR_COUNTER (Bit 0)               */
#define ECAT_PDI_ERR_COUNT_PDI_ERROR_COUNTER_Msk (0xffUL)               /*!< ECAT PDI_ERR_COUNT: PDI_ERROR_COUNTER (Bitfield-Mask: 0xff) */

/* ----------------------------  ECAT_LOST_LINK_COUNT0  --------------------------- */
#define ECAT_LOST_LINK_COUNT0_LL_COUNTER_Pos  (0UL)                     /*!< ECAT LOST_LINK_COUNT0: LL_COUNTER (Bit 0)                   */
#define ECAT_LOST_LINK_COUNT0_LL_COUNTER_Msk  (0xffUL)                  /*!< ECAT LOST_LINK_COUNT0: LL_COUNTER (Bitfield-Mask: 0xff)     */

/* ----------------------------  ECAT_LOST_LINK_COUNT1  --------------------------- */
#define ECAT_LOST_LINK_COUNT1_LL_COUNTER_Pos  (0UL)                     /*!< ECAT LOST_LINK_COUNT1: LL_COUNTER (Bit 0)                   */
#define ECAT_LOST_LINK_COUNT1_LL_COUNTER_Msk  (0xffUL)                  /*!< ECAT LOST_LINK_COUNT1: LL_COUNTER (Bitfield-Mask: 0xff)     */

/* -------------------------------  ECAT_WD_DIVIDE  ------------------------------- */
#define ECAT_WD_DIVIDE_WD_DIV_Pos             (0UL)                     /*!< ECAT WD_DIVIDE: WD_DIV (Bit 0)                              */
#define ECAT_WD_DIVIDE_WD_DIV_Msk             (0xffffUL)                /*!< ECAT WD_DIVIDE: WD_DIV (Bitfield-Mask: 0xffff)              */

/* ------------------------------  ECAT_WD_TIME_PDI  ------------------------------ */
#define ECAT_WD_TIME_PDI_WD_TIME_PDI_Pos      (0UL)                     /*!< ECAT WD_TIME_PDI: WD_TIME_PDI (Bit 0)                       */
#define ECAT_WD_TIME_PDI_WD_TIME_PDI_Msk      (0xffffUL)                /*!< ECAT WD_TIME_PDI: WD_TIME_PDI (Bitfield-Mask: 0xffff)       */

/* -----------------------------  ECAT_WD_TIME_PDATA  ----------------------------- */
#define ECAT_WD_TIME_PDATA_WD_TIME_PD_Pos     (0UL)                     /*!< ECAT WD_TIME_PDATA: WD_TIME_PD (Bit 0)                      */
#define ECAT_WD_TIME_PDATA_WD_TIME_PD_Msk     (0xffffUL)                /*!< ECAT WD_TIME_PDATA: WD_TIME_PD (Bitfield-Mask: 0xffff)      */

/* -----------------------------  ECAT_WD_STAT_PDATA  ----------------------------- */
#define ECAT_WD_STAT_PDATA_WD_STAT_PD_Pos     (0UL)                     /*!< ECAT WD_STAT_PDATA: WD_STAT_PD (Bit 0)                      */
#define ECAT_WD_STAT_PDATA_WD_STAT_PD_Msk     (0x1UL)                   /*!< ECAT WD_STAT_PDATA: WD_STAT_PD (Bitfield-Mask: 0x01)        */

/* -----------------------------  ECAT_WD_COUNT_PDATA  ---------------------------- */
#define ECAT_WD_COUNT_PDATA_WD_COUNTER_PD_Pos (0UL)                     /*!< ECAT WD_COUNT_PDATA: WD_COUNTER_PD (Bit 0)                  */
#define ECAT_WD_COUNT_PDATA_WD_COUNTER_PD_Msk (0xffUL)                  /*!< ECAT WD_COUNT_PDATA: WD_COUNTER_PD (Bitfield-Mask: 0xff)    */

/* ------------------------------  ECAT_WD_COUNT_PDI  ----------------------------- */
#define ECAT_WD_COUNT_PDI_WD_COUNTER_PDI_Pos  (0UL)                     /*!< ECAT WD_COUNT_PDI: WD_COUNTER_PDI (Bit 0)                   */
#define ECAT_WD_COUNT_PDI_WD_COUNTER_PDI_Msk  (0xffUL)                  /*!< ECAT WD_COUNT_PDI: WD_COUNTER_PDI (Bitfield-Mask: 0xff)     */

/* --------------------------------  ECAT_EEP_CONF  ------------------------------- */
#define ECAT_EEP_CONF_TO_PDI_Pos              (0UL)                     /*!< ECAT EEP_CONF: TO_PDI (Bit 0)                               */
#define ECAT_EEP_CONF_TO_PDI_Msk              (0x1UL)                   /*!< ECAT EEP_CONF: TO_PDI (Bitfield-Mask: 0x01)                 */
#define ECAT_EEP_CONF_FORCE_Pos               (1UL)                     /*!< ECAT EEP_CONF: FORCE (Bit 1)                                */
#define ECAT_EEP_CONF_FORCE_Msk               (0x2UL)                   /*!< ECAT EEP_CONF: FORCE (Bitfield-Mask: 0x01)                  */

/* -------------------------------  ECAT_EEP_STATE  ------------------------------- */
#define ECAT_EEP_STATE_ACCESS_Pos             (0UL)                     /*!< ECAT EEP_STATE: ACCESS (Bit 0)                              */
#define ECAT_EEP_STATE_ACCESS_Msk             (0x1UL)                   /*!< ECAT EEP_STATE: ACCESS (Bitfield-Mask: 0x01)                */

/* -----------------------------  ECAT_EEP_CONT_STAT  ----------------------------- */
#define ECAT_EEP_CONT_STAT_W_EN_Pos           (0UL)                     /*!< ECAT EEP_CONT_STAT: W_EN (Bit 0)                            */
#define ECAT_EEP_CONT_STAT_W_EN_Msk           (0x1UL)                   /*!< ECAT EEP_CONT_STAT: W_EN (Bitfield-Mask: 0x01)              */
#define ECAT_EEP_CONT_STAT_EMUL_Pos           (5UL)                     /*!< ECAT EEP_CONT_STAT: EMUL (Bit 5)                            */
#define ECAT_EEP_CONT_STAT_EMUL_Msk           (0x20UL)                  /*!< ECAT EEP_CONT_STAT: EMUL (Bitfield-Mask: 0x01)              */
#define ECAT_EEP_CONT_STAT_BYTES_Pos          (6UL)                     /*!< ECAT EEP_CONT_STAT: BYTES (Bit 6)                           */
#define ECAT_EEP_CONT_STAT_BYTES_Msk          (0x40UL)                  /*!< ECAT EEP_CONT_STAT: BYTES (Bitfield-Mask: 0x01)             */
#define ECAT_EEP_CONT_STAT_ALG_Pos            (7UL)                     /*!< ECAT EEP_CONT_STAT: ALG (Bit 7)                             */
#define ECAT_EEP_CONT_STAT_ALG_Msk            (0x80UL)                  /*!< ECAT EEP_CONT_STAT: ALG (Bitfield-Mask: 0x01)               */
#define ECAT_EEP_CONT_STAT_CMD_REG_Pos        (8UL)                     /*!< ECAT EEP_CONT_STAT: CMD_REG (Bit 8)                         */
#define ECAT_EEP_CONT_STAT_CMD_REG_Msk        (0x700UL)                 /*!< ECAT EEP_CONT_STAT: CMD_REG (Bitfield-Mask: 0x07)           */
#define ECAT_EEP_CONT_STAT_ERROR_Pos          (11UL)                    /*!< ECAT EEP_CONT_STAT: ERROR (Bit 11)                          */
#define ECAT_EEP_CONT_STAT_ERROR_Msk          (0x800UL)                 /*!< ECAT EEP_CONT_STAT: ERROR (Bitfield-Mask: 0x01)             */
#define ECAT_EEP_CONT_STAT_L_STAT_Pos         (12UL)                    /*!< ECAT EEP_CONT_STAT: L_STAT (Bit 12)                         */
#define ECAT_EEP_CONT_STAT_L_STAT_Msk         (0x1000UL)                /*!< ECAT EEP_CONT_STAT: L_STAT (Bitfield-Mask: 0x01)            */
#define ECAT_EEP_CONT_STAT_ERROR_AC_Pos       (13UL)                    /*!< ECAT EEP_CONT_STAT: ERROR_AC (Bit 13)                       */
#define ECAT_EEP_CONT_STAT_ERROR_AC_Msk       (0x2000UL)                /*!< ECAT EEP_CONT_STAT: ERROR_AC (Bitfield-Mask: 0x01)          */
#define ECAT_EEP_CONT_STAT_ERROR_WE_Pos       (14UL)                    /*!< ECAT EEP_CONT_STAT: ERROR_WE (Bit 14)                       */
#define ECAT_EEP_CONT_STAT_ERROR_WE_Msk       (0x4000UL)                /*!< ECAT EEP_CONT_STAT: ERROR_WE (Bitfield-Mask: 0x01)          */
#define ECAT_EEP_CONT_STAT_BUSY_Pos           (15UL)                    /*!< ECAT EEP_CONT_STAT: BUSY (Bit 15)                           */
#define ECAT_EEP_CONT_STAT_BUSY_Msk           (0x8000UL)                /*!< ECAT EEP_CONT_STAT: BUSY (Bitfield-Mask: 0x01)              */

/* --------------------------------  ECAT_EEP_ADR  -------------------------------- */
#define ECAT_EEP_ADR_EEPROM_ADDR_Pos          (0UL)                     /*!< ECAT EEP_ADR: EEPROM_ADDR (Bit 0)                           */
#define ECAT_EEP_ADR_EEPROM_ADDR_Msk          (0xffffffffUL)            /*!< ECAT EEP_ADR: EEPROM_ADDR (Bitfield-Mask: 0xffffffff)       */

/* --------------------------------  ECAT_EEP_DATA  ------------------------------- */
#define ECAT_EEP_DATA_EEP_DATA_Pos            (0UL)                     /*!< ECAT EEP_DATA: EEP_DATA (Bit 0)                             */
#define ECAT_EEP_DATA_EEP_DATA_Msk            (0xffffffffUL)            /*!< ECAT EEP_DATA: EEP_DATA (Bitfield-Mask: 0xffffffff)         */

/* -----------------------------  ECAT_MII_CONT_STAT  ----------------------------- */
#define ECAT_MII_CONT_STAT_W_EN_Pos           (0UL)                     /*!< ECAT MII_CONT_STAT: W_EN (Bit 0)                            */
#define ECAT_MII_CONT_STAT_W_EN_Msk           (0x1UL)                   /*!< ECAT MII_CONT_STAT: W_EN (Bitfield-Mask: 0x01)              */
#define ECAT_MII_CONT_STAT_MIC_PDI_Pos        (1UL)                     /*!< ECAT MII_CONT_STAT: MIC_PDI (Bit 1)                         */
#define ECAT_MII_CONT_STAT_MIC_PDI_Msk        (0x2UL)                   /*!< ECAT MII_CONT_STAT: MIC_PDI (Bitfield-Mask: 0x01)           */
#define ECAT_MII_CONT_STAT_MI_LD_Pos          (2UL)                     /*!< ECAT MII_CONT_STAT: MI_LD (Bit 2)                           */
#define ECAT_MII_CONT_STAT_MI_LD_Msk          (0x4UL)                   /*!< ECAT MII_CONT_STAT: MI_LD (Bitfield-Mask: 0x01)             */
#define ECAT_MII_CONT_STAT_PHY_ADDR_Pos       (3UL)                     /*!< ECAT MII_CONT_STAT: PHY_ADDR (Bit 3)                        */
#define ECAT_MII_CONT_STAT_PHY_ADDR_Msk       (0xf8UL)                  /*!< ECAT MII_CONT_STAT: PHY_ADDR (Bitfield-Mask: 0x1f)          */
#define ECAT_MII_CONT_STAT_CMD_REG_Pos        (8UL)                     /*!< ECAT MII_CONT_STAT: CMD_REG (Bit 8)                         */
#define ECAT_MII_CONT_STAT_CMD_REG_Msk        (0x300UL)                 /*!< ECAT MII_CONT_STAT: CMD_REG (Bitfield-Mask: 0x03)           */
#define ECAT_MII_CONT_STAT_ERROR_Pos          (14UL)                    /*!< ECAT MII_CONT_STAT: ERROR (Bit 14)                          */
#define ECAT_MII_CONT_STAT_ERROR_Msk          (0x4000UL)                /*!< ECAT MII_CONT_STAT: ERROR (Bitfield-Mask: 0x01)             */
#define ECAT_MII_CONT_STAT_BUSY_Pos           (15UL)                    /*!< ECAT MII_CONT_STAT: BUSY (Bit 15)                           */
#define ECAT_MII_CONT_STAT_BUSY_Msk           (0x8000UL)                /*!< ECAT MII_CONT_STAT: BUSY (Bitfield-Mask: 0x01)              */

/* ------------------------------  ECAT_MII_PHY_ADR  ------------------------------ */
#define ECAT_MII_PHY_ADR_PHY_ADDR_Pos         (0UL)                     /*!< ECAT MII_PHY_ADR: PHY_ADDR (Bit 0)                          */
#define ECAT_MII_PHY_ADR_PHY_ADDR_Msk         (0x1fUL)                  /*!< ECAT MII_PHY_ADR: PHY_ADDR (Bitfield-Mask: 0x1f)            */
#define ECAT_MII_PHY_ADR_PHY_CADDR_Pos        (7UL)                     /*!< ECAT MII_PHY_ADR: PHY_CADDR (Bit 7)                         */
#define ECAT_MII_PHY_ADR_PHY_CADDR_Msk        (0x80UL)                  /*!< ECAT MII_PHY_ADR: PHY_CADDR (Bitfield-Mask: 0x01)           */

/* ----------------------------  ECAT_MII_PHY_REG_ADR  ---------------------------- */
#define ECAT_MII_PHY_REG_ADR_PHY_REG_ADDR_Pos (0UL)                     /*!< ECAT MII_PHY_REG_ADR: PHY_REG_ADDR (Bit 0)                  */
#define ECAT_MII_PHY_REG_ADR_PHY_REG_ADDR_Msk (0x1fUL)                  /*!< ECAT MII_PHY_REG_ADR: PHY_REG_ADDR (Bitfield-Mask: 0x1f)    */

/* ------------------------------  ECAT_MII_PHY_DATA  ----------------------------- */
#define ECAT_MII_PHY_DATA_PHY_RW_DATA_Pos     (0UL)                     /*!< ECAT MII_PHY_DATA: PHY_RW_DATA (Bit 0)                      */
#define ECAT_MII_PHY_DATA_PHY_RW_DATA_Msk     (0xffffUL)                /*!< ECAT MII_PHY_DATA: PHY_RW_DATA (Bitfield-Mask: 0xffff)      */

