MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4300-F100F256/mcu.h
/* ---------------------------------  ECAT_DC_ACT  -------------------------------- */
#define ECAT_DC_ACT_SYNC_OUT_Pos              (0UL)                     /*!< ECAT DC_ACT: SYNC_OUT (Bit 0)                               */
#define ECAT_DC_ACT_SYNC_OUT_Msk              (0x1UL)                   /*!< ECAT DC_ACT: SYNC_OUT (Bitfield-Mask: 0x01)                 */
#define ECAT_DC_ACT_SYNC_0_Pos                (1UL)                     /*!< ECAT DC_ACT: SYNC_0 (Bit 1)                                 */
#define ECAT_DC_ACT_SYNC_0_Msk                (0x2UL)                   /*!< ECAT DC_ACT: SYNC_0 (Bitfield-Mask: 0x01)                   */
#define ECAT_DC_ACT_SYNC_1_Pos                (2UL)                     /*!< ECAT DC_ACT: SYNC_1 (Bit 2)                                 */
#define ECAT_DC_ACT_SYNC_1_Msk                (0x4UL)                   /*!< ECAT DC_ACT: SYNC_1 (Bitfield-Mask: 0x01)                   */

/* ------------------------------  ECAT_DC_PULSE_LEN  ----------------------------- */
#define ECAT_DC_PULSE_LEN_PULS_LENGTH_Pos     (0UL)                     /*!< ECAT DC_PULSE_LEN: PULS_LENGTH (Bit 0)                      */
#define ECAT_DC_PULSE_LEN_PULS_LENGTH_Msk     (0xffffUL)                /*!< ECAT DC_PULSE_LEN: PULS_LENGTH (Bitfield-Mask: 0xffff)      */

/* ------------------------------  ECAT_DC_ACT_STAT  ------------------------------ */
#define ECAT_DC_ACT_STAT_S0_ACK_STATE_Pos     (0UL)                     /*!< ECAT DC_ACT_STAT: S0_ACK_STATE (Bit 0)                      */
#define ECAT_DC_ACT_STAT_S0_ACK_STATE_Msk     (0x1UL)                   /*!< ECAT DC_ACT_STAT: S0_ACK_STATE (Bitfield-Mask: 0x01)        */
#define ECAT_DC_ACT_STAT_S1_ACK_STATE_Pos     (1UL)                     /*!< ECAT DC_ACT_STAT: S1_ACK_STATE (Bit 1)                      */
#define ECAT_DC_ACT_STAT_S1_ACK_STATE_Msk     (0x2UL)                   /*!< ECAT DC_ACT_STAT: S1_ACK_STATE (Bitfield-Mask: 0x01)        */
#define ECAT_DC_ACT_STAT_S_TIME_Pos           (2UL)                     /*!< ECAT DC_ACT_STAT: S_TIME (Bit 2)                            */
#define ECAT_DC_ACT_STAT_S_TIME_Msk           (0x4UL)                   /*!< ECAT DC_ACT_STAT: S_TIME (Bitfield-Mask: 0x01)              */

/* -----------------------------  ECAT_DC_SYNC0_STAT  ----------------------------- */
#define ECAT_DC_SYNC0_STAT_S0_STATE_Pos       (0UL)                     /*!< ECAT DC_SYNC0_STAT: S0_STATE (Bit 0)                        */
#define ECAT_DC_SYNC0_STAT_S0_STATE_Msk       (0x1UL)                   /*!< ECAT DC_SYNC0_STAT: S0_STATE (Bitfield-Mask: 0x01)          */

/* -----------------------------  ECAT_DC_SYNC1_STAT  ----------------------------- */
#define ECAT_DC_SYNC1_STAT_S1_STATE_Pos       (0UL)                     /*!< ECAT DC_SYNC1_STAT: S1_STATE (Bit 0)                        */
#define ECAT_DC_SYNC1_STAT_S1_STATE_Msk       (0x1UL)                   /*!< ECAT DC_SYNC1_STAT: S1_STATE (Bitfield-Mask: 0x01)          */

/* ---------------------------  ECAT_DC_CYC_START_TIME  --------------------------- */
#define ECAT_DC_CYC_START_TIME_DC_CYC_START_TIME_Pos (0UL)              /*!< ECAT DC_CYC_START_TIME: DC_CYC_START_TIME (Bit 0)           */
#define ECAT_DC_CYC_START_TIME_DC_CYC_START_TIME_Msk (0xffffffffUL)     /*!< ECAT DC_CYC_START_TIME: DC_CYC_START_TIME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  ECAT_DC_NEXT_SYNC1_PULSE  -------------------------- */
#define ECAT_DC_NEXT_SYNC1_PULSE_DC_NEXT_SYNC1_PULSE_Pos (0UL)          /*!< ECAT DC_NEXT_SYNC1_PULSE: DC_NEXT_SYNC1_PULSE (Bit 0)       */
#define ECAT_DC_NEXT_SYNC1_PULSE_DC_NEXT_SYNC1_PULSE_Msk (0xffffffffUL) /*!< ECAT DC_NEXT_SYNC1_PULSE: DC_NEXT_SYNC1_PULSE (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  ECAT_DC_SYNC0_CYC_TIME  --------------------------- */
#define ECAT_DC_SYNC0_CYC_TIME_TIME_BETWEEN_SYNC0_Pos (0UL)             /*!< ECAT DC_SYNC0_CYC_TIME: TIME_BETWEEN_SYNC0 (Bit 0)          */
#define ECAT_DC_SYNC0_CYC_TIME_TIME_BETWEEN_SYNC0_Msk (0xffffffffUL)    /*!< ECAT DC_SYNC0_CYC_TIME: TIME_BETWEEN_SYNC0 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  ECAT_DC_SYNC1_CYC_TIME  --------------------------- */
#define ECAT_DC_SYNC1_CYC_TIME_TIME_SYNC1_SYNC0_Pos (0UL)               /*!< ECAT DC_SYNC1_CYC_TIME: TIME_SYNC1_SYNC0 (Bit 0)            */
#define ECAT_DC_SYNC1_CYC_TIME_TIME_SYNC1_SYNC0_Msk (0xffffffffUL)      /*!< ECAT DC_SYNC1_CYC_TIME: TIME_SYNC1_SYNC0 (Bitfield-Mask: 0xffffffff) */

/* -----------------------------  ECAT_DC_LATCH0_CONT  ---------------------------- */
#define ECAT_DC_LATCH0_CONT_L0_POS_Pos        (0UL)                     /*!< ECAT DC_LATCH0_CONT: L0_POS (Bit 0)                         */
#define ECAT_DC_LATCH0_CONT_L0_POS_Msk        (0x1UL)                   /*!< ECAT DC_LATCH0_CONT: L0_POS (Bitfield-Mask: 0x01)           */
#define ECAT_DC_LATCH0_CONT_L0_NEG_Pos        (1UL)                     /*!< ECAT DC_LATCH0_CONT: L0_NEG (Bit 1)                         */
#define ECAT_DC_LATCH0_CONT_L0_NEG_Msk        (0x2UL)                   /*!< ECAT DC_LATCH0_CONT: L0_NEG (Bitfield-Mask: 0x01)           */

/* -----------------------------  ECAT_DC_LATCH1_CONT  ---------------------------- */
#define ECAT_DC_LATCH1_CONT_L1_POS_Pos        (0UL)                     /*!< ECAT DC_LATCH1_CONT: L1_POS (Bit 0)                         */
#define ECAT_DC_LATCH1_CONT_L1_POS_Msk        (0x1UL)                   /*!< ECAT DC_LATCH1_CONT: L1_POS (Bitfield-Mask: 0x01)           */
#define ECAT_DC_LATCH1_CONT_L1_NEG_Pos        (1UL)                     /*!< ECAT DC_LATCH1_CONT: L1_NEG (Bit 1)                         */
#define ECAT_DC_LATCH1_CONT_L1_NEG_Msk        (0x2UL)                   /*!< ECAT DC_LATCH1_CONT: L1_NEG (Bitfield-Mask: 0x01)           */

/* -----------------------------  ECAT_DC_LATCH0_STAT  ---------------------------- */
#define ECAT_DC_LATCH0_STAT_EV_L0_POS_Pos     (0UL)                     /*!< ECAT DC_LATCH0_STAT: EV_L0_POS (Bit 0)                      */
#define ECAT_DC_LATCH0_STAT_EV_L0_POS_Msk     (0x1UL)                   /*!< ECAT DC_LATCH0_STAT: EV_L0_POS (Bitfield-Mask: 0x01)        */
#define ECAT_DC_LATCH0_STAT_EV_L0_NEG_Pos     (1UL)                     /*!< ECAT DC_LATCH0_STAT: EV_L0_NEG (Bit 1)                      */
#define ECAT_DC_LATCH0_STAT_EV_L0_NEG_Msk     (0x2UL)                   /*!< ECAT DC_LATCH0_STAT: EV_L0_NEG (Bitfield-Mask: 0x01)        */
#define ECAT_DC_LATCH0_STAT_L0_PIN_Pos        (2UL)                     /*!< ECAT DC_LATCH0_STAT: L0_PIN (Bit 2)                         */
#define ECAT_DC_LATCH0_STAT_L0_PIN_Msk        (0x4UL)                   /*!< ECAT DC_LATCH0_STAT: L0_PIN (Bitfield-Mask: 0x01)           */

/* -----------------------------  ECAT_DC_LATCH1_STAT  ---------------------------- */
#define ECAT_DC_LATCH1_STAT_EV_L1_POS_Pos     (0UL)                     /*!< ECAT DC_LATCH1_STAT: EV_L1_POS (Bit 0)                      */
#define ECAT_DC_LATCH1_STAT_EV_L1_POS_Msk     (0x1UL)                   /*!< ECAT DC_LATCH1_STAT: EV_L1_POS (Bitfield-Mask: 0x01)        */
#define ECAT_DC_LATCH1_STAT_EV_L1_NEG_Pos     (1UL)                     /*!< ECAT DC_LATCH1_STAT: EV_L1_NEG (Bit 1)                      */
#define ECAT_DC_LATCH1_STAT_EV_L1_NEG_Msk     (0x2UL)                   /*!< ECAT DC_LATCH1_STAT: EV_L1_NEG (Bitfield-Mask: 0x01)        */
#define ECAT_DC_LATCH1_STAT_L1_PIN_Pos        (2UL)                     /*!< ECAT DC_LATCH1_STAT: L1_PIN (Bit 2)                         */
#define ECAT_DC_LATCH1_STAT_L1_PIN_Msk        (0x4UL)                   /*!< ECAT DC_LATCH1_STAT: L1_PIN (Bitfield-Mask: 0x01)           */

