MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4300-F100F256/mcu.h
/* ----------------------------------  PORT4_PPS  --------------------------------- */
#define PORT4_PPS_PPS0_Pos                    (0UL)                     /*!< PORT4 PPS: PPS0 (Bit 0)                                     */
#define PORT4_PPS_PPS0_Msk                    (0x1UL)                   /*!< PORT4 PPS: PPS0 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS1_Pos                    (1UL)                     /*!< PORT4 PPS: PPS1 (Bit 1)                                     */
#define PORT4_PPS_PPS1_Msk                    (0x2UL)                   /*!< PORT4 PPS: PPS1 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS2_Pos                    (2UL)                     /*!< PORT4 PPS: PPS2 (Bit 2)                                     */
#define PORT4_PPS_PPS2_Msk                    (0x4UL)                   /*!< PORT4 PPS: PPS2 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS3_Pos                    (3UL)                     /*!< PORT4 PPS: PPS3 (Bit 3)                                     */
#define PORT4_PPS_PPS3_Msk                    (0x8UL)                   /*!< PORT4 PPS: PPS3 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS4_Pos                    (4UL)                     /*!< PORT4 PPS: PPS4 (Bit 4)                                     */
#define PORT4_PPS_PPS4_Msk                    (0x10UL)                  /*!< PORT4 PPS: PPS4 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS5_Pos                    (5UL)                     /*!< PORT4 PPS: PPS5 (Bit 5)                                     */
#define PORT4_PPS_PPS5_Msk                    (0x20UL)                  /*!< PORT4 PPS: PPS5 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS6_Pos                    (6UL)                     /*!< PORT4 PPS: PPS6 (Bit 6)                                     */
#define PORT4_PPS_PPS6_Msk                    (0x40UL)                  /*!< PORT4 PPS: PPS6 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS7_Pos                    (7UL)                     /*!< PORT4 PPS: PPS7 (Bit 7)                                     */
#define PORT4_PPS_PPS7_Msk                    (0x80UL)                  /*!< PORT4 PPS: PPS7 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS8_Pos                    (8UL)                     /*!< PORT4 PPS: PPS8 (Bit 8)                                     */
#define PORT4_PPS_PPS8_Msk                    (0x100UL)                 /*!< PORT4 PPS: PPS8 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS9_Pos                    (9UL)                     /*!< PORT4 PPS: PPS9 (Bit 9)                                     */
#define PORT4_PPS_PPS9_Msk                    (0x200UL)                 /*!< PORT4 PPS: PPS9 (Bitfield-Mask: 0x01)                       */
#define PORT4_PPS_PPS10_Pos                   (10UL)                    /*!< PORT4 PPS: PPS10 (Bit 10)                                   */
#define PORT4_PPS_PPS10_Msk                   (0x400UL)                 /*!< PORT4 PPS: PPS10 (Bitfield-Mask: 0x01)                      */
#define PORT4_PPS_PPS11_Pos                   (11UL)                    /*!< PORT4 PPS: PPS11 (Bit 11)                                   */
#define PORT4_PPS_PPS11_Msk                   (0x800UL)                 /*!< PORT4 PPS: PPS11 (Bitfield-Mask: 0x01)                      */
#define PORT4_PPS_PPS12_Pos                   (12UL)                    /*!< PORT4 PPS: PPS12 (Bit 12)                                   */
#define PORT4_PPS_PPS12_Msk                   (0x1000UL)                /*!< PORT4 PPS: PPS12 (Bitfield-Mask: 0x01)                      */
#define PORT4_PPS_PPS13_Pos                   (13UL)                    /*!< PORT4 PPS: PPS13 (Bit 13)                                   */
#define PORT4_PPS_PPS13_Msk                   (0x2000UL)                /*!< PORT4 PPS: PPS13 (Bitfield-Mask: 0x01)                      */
#define PORT4_PPS_PPS14_Pos                   (14UL)                    /*!< PORT4 PPS: PPS14 (Bit 14)                                   */
#define PORT4_PPS_PPS14_Msk                   (0x4000UL)                /*!< PORT4 PPS: PPS14 (Bitfield-Mask: 0x01)                      */
#define PORT4_PPS_PPS15_Pos                   (15UL)                    /*!< PORT4 PPS: PPS15 (Bit 15)                                   */
#define PORT4_PPS_PPS15_Msk                   (0x8000UL)                /*!< PORT4 PPS: PPS15 (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  PORT4_HWSEL  -------------------------------- */
#define PORT4_HWSEL_HW0_Pos                   (0UL)                     /*!< PORT4 HWSEL: HW0 (Bit 0)                                    */
#define PORT4_HWSEL_HW0_Msk                   (0x3UL)                   /*!< PORT4 HWSEL: HW0 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW1_Pos                   (2UL)                     /*!< PORT4 HWSEL: HW1 (Bit 2)                                    */
#define PORT4_HWSEL_HW1_Msk                   (0xcUL)                   /*!< PORT4 HWSEL: HW1 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW2_Pos                   (4UL)                     /*!< PORT4 HWSEL: HW2 (Bit 4)                                    */
#define PORT4_HWSEL_HW2_Msk                   (0x30UL)                  /*!< PORT4 HWSEL: HW2 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW3_Pos                   (6UL)                     /*!< PORT4 HWSEL: HW3 (Bit 6)                                    */
#define PORT4_HWSEL_HW3_Msk                   (0xc0UL)                  /*!< PORT4 HWSEL: HW3 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW4_Pos                   (8UL)                     /*!< PORT4 HWSEL: HW4 (Bit 8)                                    */
#define PORT4_HWSEL_HW4_Msk                   (0x300UL)                 /*!< PORT4 HWSEL: HW4 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW5_Pos                   (10UL)                    /*!< PORT4 HWSEL: HW5 (Bit 10)                                   */
#define PORT4_HWSEL_HW5_Msk                   (0xc00UL)                 /*!< PORT4 HWSEL: HW5 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW6_Pos                   (12UL)                    /*!< PORT4 HWSEL: HW6 (Bit 12)                                   */
#define PORT4_HWSEL_HW6_Msk                   (0x3000UL)                /*!< PORT4 HWSEL: HW6 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW7_Pos                   (14UL)                    /*!< PORT4 HWSEL: HW7 (Bit 14)                                   */
#define PORT4_HWSEL_HW7_Msk                   (0xc000UL)                /*!< PORT4 HWSEL: HW7 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW8_Pos                   (16UL)                    /*!< PORT4 HWSEL: HW8 (Bit 16)                                   */
#define PORT4_HWSEL_HW8_Msk                   (0x30000UL)               /*!< PORT4 HWSEL: HW8 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW9_Pos                   (18UL)                    /*!< PORT4 HWSEL: HW9 (Bit 18)                                   */
#define PORT4_HWSEL_HW9_Msk                   (0xc0000UL)               /*!< PORT4 HWSEL: HW9 (Bitfield-Mask: 0x03)                      */
#define PORT4_HWSEL_HW10_Pos                  (20UL)                    /*!< PORT4 HWSEL: HW10 (Bit 20)                                  */
#define PORT4_HWSEL_HW10_Msk                  (0x300000UL)              /*!< PORT4 HWSEL: HW10 (Bitfield-Mask: 0x03)                     */
#define PORT4_HWSEL_HW11_Pos                  (22UL)                    /*!< PORT4 HWSEL: HW11 (Bit 22)                                  */
#define PORT4_HWSEL_HW11_Msk                  (0xc00000UL)              /*!< PORT4 HWSEL: HW11 (Bitfield-Mask: 0x03)                     */
#define PORT4_HWSEL_HW12_Pos                  (24UL)                    /*!< PORT4 HWSEL: HW12 (Bit 24)                                  */
#define PORT4_HWSEL_HW12_Msk                  (0x3000000UL)             /*!< PORT4 HWSEL: HW12 (Bitfield-Mask: 0x03)                     */
#define PORT4_HWSEL_HW13_Pos                  (26UL)                    /*!< PORT4 HWSEL: HW13 (Bit 26)                                  */
#define PORT4_HWSEL_HW13_Msk                  (0xc000000UL)             /*!< PORT4 HWSEL: HW13 (Bitfield-Mask: 0x03)                     */
#define PORT4_HWSEL_HW14_Pos                  (28UL)                    /*!< PORT4 HWSEL: HW14 (Bit 28)                                  */
#define PORT4_HWSEL_HW14_Msk                  (0x30000000UL)            /*!< PORT4 HWSEL: HW14 (Bitfield-Mask: 0x03)                     */
#define PORT4_HWSEL_HW15_Pos                  (30UL)                    /*!< PORT4 HWSEL: HW15 (Bit 30)                                  */
#define PORT4_HWSEL_HW15_Msk                  (0xc0000000UL)            /*!< PORT4 HWSEL: HW15 (Bitfield-Mask: 0x03)                     */


/* ================================================================================ */
/* ================         struct 'PORT5' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  PORT5_OUT  --------------------------------- */
#define PORT5_OUT_P0_Pos                      (0UL)                     /*!< PORT5 OUT: P0 (Bit 0)                                       */
#define PORT5_OUT_P0_Msk                      (0x1UL)                   /*!< PORT5 OUT: P0 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P1_Pos                      (1UL)                     /*!< PORT5 OUT: P1 (Bit 1)                                       */
#define PORT5_OUT_P1_Msk                      (0x2UL)                   /*!< PORT5 OUT: P1 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P2_Pos                      (2UL)                     /*!< PORT5 OUT: P2 (Bit 2)                                       */
#define PORT5_OUT_P2_Msk                      (0x4UL)                   /*!< PORT5 OUT: P2 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P3_Pos                      (3UL)                     /*!< PORT5 OUT: P3 (Bit 3)                                       */
#define PORT5_OUT_P3_Msk                      (0x8UL)                   /*!< PORT5 OUT: P3 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P4_Pos                      (4UL)                     /*!< PORT5 OUT: P4 (Bit 4)                                       */
#define PORT5_OUT_P4_Msk                      (0x10UL)                  /*!< PORT5 OUT: P4 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P5_Pos                      (5UL)                     /*!< PORT5 OUT: P5 (Bit 5)                                       */
#define PORT5_OUT_P5_Msk                      (0x20UL)                  /*!< PORT5 OUT: P5 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P6_Pos                      (6UL)                     /*!< PORT5 OUT: P6 (Bit 6)                                       */
#define PORT5_OUT_P6_Msk                      (0x40UL)                  /*!< PORT5 OUT: P6 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P7_Pos                      (7UL)                     /*!< PORT5 OUT: P7 (Bit 7)                                       */
#define PORT5_OUT_P7_Msk                      (0x80UL)                  /*!< PORT5 OUT: P7 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P8_Pos                      (8UL)                     /*!< PORT5 OUT: P8 (Bit 8)                                       */
#define PORT5_OUT_P8_Msk                      (0x100UL)                 /*!< PORT5 OUT: P8 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P9_Pos                      (9UL)                     /*!< PORT5 OUT: P9 (Bit 9)                                       */
#define PORT5_OUT_P9_Msk                      (0x200UL)                 /*!< PORT5 OUT: P9 (Bitfield-Mask: 0x01)                         */
#define PORT5_OUT_P10_Pos                     (10UL)                    /*!< PORT5 OUT: P10 (Bit 10)                                     */
#define PORT5_OUT_P10_Msk                     (0x400UL)                 /*!< PORT5 OUT: P10 (Bitfield-Mask: 0x01)                        */
#define PORT5_OUT_P11_Pos                     (11UL)                    /*!< PORT5 OUT: P11 (Bit 11)                                     */
#define PORT5_OUT_P11_Msk                     (0x800UL)                 /*!< PORT5 OUT: P11 (Bitfield-Mask: 0x01)                        */
#define PORT5_OUT_P12_Pos                     (12UL)                    /*!< PORT5 OUT: P12 (Bit 12)                                     */
#define PORT5_OUT_P12_Msk                     (0x1000UL)                /*!< PORT5 OUT: P12 (Bitfield-Mask: 0x01)                        */
#define PORT5_OUT_P13_Pos                     (13UL)                    /*!< PORT5 OUT: P13 (Bit 13)                                     */
#define PORT5_OUT_P13_Msk                     (0x2000UL)                /*!< PORT5 OUT: P13 (Bitfield-Mask: 0x01)                        */
#define PORT5_OUT_P14_Pos                     (14UL)                    /*!< PORT5 OUT: P14 (Bit 14)                                     */
#define PORT5_OUT_P14_Msk                     (0x4000UL)                /*!< PORT5 OUT: P14 (Bitfield-Mask: 0x01)                        */
#define PORT5_OUT_P15_Pos                     (15UL)                    /*!< PORT5 OUT: P15 (Bit 15)                                     */
#define PORT5_OUT_P15_Msk                     (0x8000UL)                /*!< PORT5 OUT: P15 (Bitfield-Mask: 0x01)                        */

/* ----------------------------------  PORT5_OMR  --------------------------------- */
#define PORT5_OMR_PS0_Pos                     (0UL)                     /*!< PORT5 OMR: PS0 (Bit 0)                                      */
#define PORT5_OMR_PS0_Msk                     (0x1UL)                   /*!< PORT5 OMR: PS0 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS1_Pos                     (1UL)                     /*!< PORT5 OMR: PS1 (Bit 1)                                      */
#define PORT5_OMR_PS1_Msk                     (0x2UL)                   /*!< PORT5 OMR: PS1 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS2_Pos                     (2UL)                     /*!< PORT5 OMR: PS2 (Bit 2)                                      */
#define PORT5_OMR_PS2_Msk                     (0x4UL)                   /*!< PORT5 OMR: PS2 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS3_Pos                     (3UL)                     /*!< PORT5 OMR: PS3 (Bit 3)                                      */
#define PORT5_OMR_PS3_Msk                     (0x8UL)                   /*!< PORT5 OMR: PS3 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS4_Pos                     (4UL)                     /*!< PORT5 OMR: PS4 (Bit 4)                                      */
#define PORT5_OMR_PS4_Msk                     (0x10UL)                  /*!< PORT5 OMR: PS4 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS5_Pos                     (5UL)                     /*!< PORT5 OMR: PS5 (Bit 5)                                      */
#define PORT5_OMR_PS5_Msk                     (0x20UL)                  /*!< PORT5 OMR: PS5 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS6_Pos                     (6UL)                     /*!< PORT5 OMR: PS6 (Bit 6)                                      */
#define PORT5_OMR_PS6_Msk                     (0x40UL)                  /*!< PORT5 OMR: PS6 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS7_Pos                     (7UL)                     /*!< PORT5 OMR: PS7 (Bit 7)                                      */
#define PORT5_OMR_PS7_Msk                     (0x80UL)                  /*!< PORT5 OMR: PS7 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS8_Pos                     (8UL)                     /*!< PORT5 OMR: PS8 (Bit 8)                                      */
#define PORT5_OMR_PS8_Msk                     (0x100UL)                 /*!< PORT5 OMR: PS8 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS9_Pos                     (9UL)                     /*!< PORT5 OMR: PS9 (Bit 9)                                      */
#define PORT5_OMR_PS9_Msk                     (0x200UL)                 /*!< PORT5 OMR: PS9 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PS10_Pos                    (10UL)                    /*!< PORT5 OMR: PS10 (Bit 10)                                    */
#define PORT5_OMR_PS10_Msk                    (0x400UL)                 /*!< PORT5 OMR: PS10 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PS11_Pos                    (11UL)                    /*!< PORT5 OMR: PS11 (Bit 11)                                    */
#define PORT5_OMR_PS11_Msk                    (0x800UL)                 /*!< PORT5 OMR: PS11 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PS12_Pos                    (12UL)                    /*!< PORT5 OMR: PS12 (Bit 12)                                    */
#define PORT5_OMR_PS12_Msk                    (0x1000UL)                /*!< PORT5 OMR: PS12 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PS13_Pos                    (13UL)                    /*!< PORT5 OMR: PS13 (Bit 13)                                    */
#define PORT5_OMR_PS13_Msk                    (0x2000UL)                /*!< PORT5 OMR: PS13 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PS14_Pos                    (14UL)                    /*!< PORT5 OMR: PS14 (Bit 14)                                    */
#define PORT5_OMR_PS14_Msk                    (0x4000UL)                /*!< PORT5 OMR: PS14 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PS15_Pos                    (15UL)                    /*!< PORT5 OMR: PS15 (Bit 15)                                    */
#define PORT5_OMR_PS15_Msk                    (0x8000UL)                /*!< PORT5 OMR: PS15 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PR0_Pos                     (16UL)                    /*!< PORT5 OMR: PR0 (Bit 16)                                     */
#define PORT5_OMR_PR0_Msk                     (0x10000UL)               /*!< PORT5 OMR: PR0 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR1_Pos                     (17UL)                    /*!< PORT5 OMR: PR1 (Bit 17)                                     */
#define PORT5_OMR_PR1_Msk                     (0x20000UL)               /*!< PORT5 OMR: PR1 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR2_Pos                     (18UL)                    /*!< PORT5 OMR: PR2 (Bit 18)                                     */
#define PORT5_OMR_PR2_Msk                     (0x40000UL)               /*!< PORT5 OMR: PR2 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR3_Pos                     (19UL)                    /*!< PORT5 OMR: PR3 (Bit 19)                                     */
#define PORT5_OMR_PR3_Msk                     (0x80000UL)               /*!< PORT5 OMR: PR3 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR4_Pos                     (20UL)                    /*!< PORT5 OMR: PR4 (Bit 20)                                     */
#define PORT5_OMR_PR4_Msk                     (0x100000UL)              /*!< PORT5 OMR: PR4 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR5_Pos                     (21UL)                    /*!< PORT5 OMR: PR5 (Bit 21)                                     */
#define PORT5_OMR_PR5_Msk                     (0x200000UL)              /*!< PORT5 OMR: PR5 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR6_Pos                     (22UL)                    /*!< PORT5 OMR: PR6 (Bit 22)                                     */
#define PORT5_OMR_PR6_Msk                     (0x400000UL)              /*!< PORT5 OMR: PR6 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR7_Pos                     (23UL)                    /*!< PORT5 OMR: PR7 (Bit 23)                                     */
#define PORT5_OMR_PR7_Msk                     (0x800000UL)              /*!< PORT5 OMR: PR7 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR8_Pos                     (24UL)                    /*!< PORT5 OMR: PR8 (Bit 24)                                     */
#define PORT5_OMR_PR8_Msk                     (0x1000000UL)             /*!< PORT5 OMR: PR8 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR9_Pos                     (25UL)                    /*!< PORT5 OMR: PR9 (Bit 25)                                     */
#define PORT5_OMR_PR9_Msk                     (0x2000000UL)             /*!< PORT5 OMR: PR9 (Bitfield-Mask: 0x01)                        */
#define PORT5_OMR_PR10_Pos                    (26UL)                    /*!< PORT5 OMR: PR10 (Bit 26)                                    */
#define PORT5_OMR_PR10_Msk                    (0x4000000UL)             /*!< PORT5 OMR: PR10 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PR11_Pos                    (27UL)                    /*!< PORT5 OMR: PR11 (Bit 27)                                    */
#define PORT5_OMR_PR11_Msk                    (0x8000000UL)             /*!< PORT5 OMR: PR11 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PR12_Pos                    (28UL)                    /*!< PORT5 OMR: PR12 (Bit 28)                                    */
#define PORT5_OMR_PR12_Msk                    (0x10000000UL)            /*!< PORT5 OMR: PR12 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PR13_Pos                    (29UL)                    /*!< PORT5 OMR: PR13 (Bit 29)                                    */
#define PORT5_OMR_PR13_Msk                    (0x20000000UL)            /*!< PORT5 OMR: PR13 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PR14_Pos                    (30UL)                    /*!< PORT5 OMR: PR14 (Bit 30)                                    */
#define PORT5_OMR_PR14_Msk                    (0x40000000UL)            /*!< PORT5 OMR: PR14 (Bitfield-Mask: 0x01)                       */
#define PORT5_OMR_PR15_Pos                    (31UL)                    /*!< PORT5 OMR: PR15 (Bit 31)                                    */
#define PORT5_OMR_PR15_Msk                    (0x80000000UL)            /*!< PORT5 OMR: PR15 (Bitfield-Mask: 0x01)                       */

