MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4300-F100F256/mcu.h
/* ---------------------------------  PORT15_PPS  --------------------------------- */
#define PORT15_PPS_PPS0_Pos                   (0UL)                     /*!< PORT15 PPS: PPS0 (Bit 0)                                    */
#define PORT15_PPS_PPS0_Msk                   (0x1UL)                   /*!< PORT15 PPS: PPS0 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS1_Pos                   (1UL)                     /*!< PORT15 PPS: PPS1 (Bit 1)                                    */
#define PORT15_PPS_PPS1_Msk                   (0x2UL)                   /*!< PORT15 PPS: PPS1 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS2_Pos                   (2UL)                     /*!< PORT15 PPS: PPS2 (Bit 2)                                    */
#define PORT15_PPS_PPS2_Msk                   (0x4UL)                   /*!< PORT15 PPS: PPS2 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS3_Pos                   (3UL)                     /*!< PORT15 PPS: PPS3 (Bit 3)                                    */
#define PORT15_PPS_PPS3_Msk                   (0x8UL)                   /*!< PORT15 PPS: PPS3 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS4_Pos                   (4UL)                     /*!< PORT15 PPS: PPS4 (Bit 4)                                    */
#define PORT15_PPS_PPS4_Msk                   (0x10UL)                  /*!< PORT15 PPS: PPS4 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS5_Pos                   (5UL)                     /*!< PORT15 PPS: PPS5 (Bit 5)                                    */
#define PORT15_PPS_PPS5_Msk                   (0x20UL)                  /*!< PORT15 PPS: PPS5 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS6_Pos                   (6UL)                     /*!< PORT15 PPS: PPS6 (Bit 6)                                    */
#define PORT15_PPS_PPS6_Msk                   (0x40UL)                  /*!< PORT15 PPS: PPS6 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS7_Pos                   (7UL)                     /*!< PORT15 PPS: PPS7 (Bit 7)                                    */
#define PORT15_PPS_PPS7_Msk                   (0x80UL)                  /*!< PORT15 PPS: PPS7 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS8_Pos                   (8UL)                     /*!< PORT15 PPS: PPS8 (Bit 8)                                    */
#define PORT15_PPS_PPS8_Msk                   (0x100UL)                 /*!< PORT15 PPS: PPS8 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS9_Pos                   (9UL)                     /*!< PORT15 PPS: PPS9 (Bit 9)                                    */
#define PORT15_PPS_PPS9_Msk                   (0x200UL)                 /*!< PORT15 PPS: PPS9 (Bitfield-Mask: 0x01)                      */
#define PORT15_PPS_PPS10_Pos                  (10UL)                    /*!< PORT15 PPS: PPS10 (Bit 10)                                  */
#define PORT15_PPS_PPS10_Msk                  (0x400UL)                 /*!< PORT15 PPS: PPS10 (Bitfield-Mask: 0x01)                     */
#define PORT15_PPS_PPS11_Pos                  (11UL)                    /*!< PORT15 PPS: PPS11 (Bit 11)                                  */
#define PORT15_PPS_PPS11_Msk                  (0x800UL)                 /*!< PORT15 PPS: PPS11 (Bitfield-Mask: 0x01)                     */
#define PORT15_PPS_PPS12_Pos                  (12UL)                    /*!< PORT15 PPS: PPS12 (Bit 12)                                  */
#define PORT15_PPS_PPS12_Msk                  (0x1000UL)                /*!< PORT15 PPS: PPS12 (Bitfield-Mask: 0x01)                     */
#define PORT15_PPS_PPS13_Pos                  (13UL)                    /*!< PORT15 PPS: PPS13 (Bit 13)                                  */
#define PORT15_PPS_PPS13_Msk                  (0x2000UL)                /*!< PORT15 PPS: PPS13 (Bitfield-Mask: 0x01)                     */
#define PORT15_PPS_PPS14_Pos                  (14UL)                    /*!< PORT15 PPS: PPS14 (Bit 14)                                  */
#define PORT15_PPS_PPS14_Msk                  (0x4000UL)                /*!< PORT15 PPS: PPS14 (Bitfield-Mask: 0x01)                     */
#define PORT15_PPS_PPS15_Pos                  (15UL)                    /*!< PORT15 PPS: PPS15 (Bit 15)                                  */
#define PORT15_PPS_PPS15_Msk                  (0x8000UL)                /*!< PORT15 PPS: PPS15 (Bitfield-Mask: 0x01)                     */

/* --------------------------------  PORT15_HWSEL  -------------------------------- */
#define PORT15_HWSEL_HW0_Pos                  (0UL)                     /*!< PORT15 HWSEL: HW0 (Bit 0)                                   */
#define PORT15_HWSEL_HW0_Msk                  (0x3UL)                   /*!< PORT15 HWSEL: HW0 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW1_Pos                  (2UL)                     /*!< PORT15 HWSEL: HW1 (Bit 2)                                   */
#define PORT15_HWSEL_HW1_Msk                  (0xcUL)                   /*!< PORT15 HWSEL: HW1 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW2_Pos                  (4UL)                     /*!< PORT15 HWSEL: HW2 (Bit 4)                                   */
#define PORT15_HWSEL_HW2_Msk                  (0x30UL)                  /*!< PORT15 HWSEL: HW2 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW3_Pos                  (6UL)                     /*!< PORT15 HWSEL: HW3 (Bit 6)                                   */
#define PORT15_HWSEL_HW3_Msk                  (0xc0UL)                  /*!< PORT15 HWSEL: HW3 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW4_Pos                  (8UL)                     /*!< PORT15 HWSEL: HW4 (Bit 8)                                   */
#define PORT15_HWSEL_HW4_Msk                  (0x300UL)                 /*!< PORT15 HWSEL: HW4 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW5_Pos                  (10UL)                    /*!< PORT15 HWSEL: HW5 (Bit 10)                                  */
#define PORT15_HWSEL_HW5_Msk                  (0xc00UL)                 /*!< PORT15 HWSEL: HW5 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW6_Pos                  (12UL)                    /*!< PORT15 HWSEL: HW6 (Bit 12)                                  */
#define PORT15_HWSEL_HW6_Msk                  (0x3000UL)                /*!< PORT15 HWSEL: HW6 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW7_Pos                  (14UL)                    /*!< PORT15 HWSEL: HW7 (Bit 14)                                  */
#define PORT15_HWSEL_HW7_Msk                  (0xc000UL)                /*!< PORT15 HWSEL: HW7 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW8_Pos                  (16UL)                    /*!< PORT15 HWSEL: HW8 (Bit 16)                                  */
#define PORT15_HWSEL_HW8_Msk                  (0x30000UL)               /*!< PORT15 HWSEL: HW8 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW9_Pos                  (18UL)                    /*!< PORT15 HWSEL: HW9 (Bit 18)                                  */
#define PORT15_HWSEL_HW9_Msk                  (0xc0000UL)               /*!< PORT15 HWSEL: HW9 (Bitfield-Mask: 0x03)                     */
#define PORT15_HWSEL_HW10_Pos                 (20UL)                    /*!< PORT15 HWSEL: HW10 (Bit 20)                                 */
#define PORT15_HWSEL_HW10_Msk                 (0x300000UL)              /*!< PORT15 HWSEL: HW10 (Bitfield-Mask: 0x03)                    */
#define PORT15_HWSEL_HW11_Pos                 (22UL)                    /*!< PORT15 HWSEL: HW11 (Bit 22)                                 */
#define PORT15_HWSEL_HW11_Msk                 (0xc00000UL)              /*!< PORT15 HWSEL: HW11 (Bitfield-Mask: 0x03)                    */
#define PORT15_HWSEL_HW12_Pos                 (24UL)                    /*!< PORT15 HWSEL: HW12 (Bit 24)                                 */
#define PORT15_HWSEL_HW12_Msk                 (0x3000000UL)             /*!< PORT15 HWSEL: HW12 (Bitfield-Mask: 0x03)                    */
#define PORT15_HWSEL_HW13_Pos                 (26UL)                    /*!< PORT15 HWSEL: HW13 (Bit 26)                                 */
#define PORT15_HWSEL_HW13_Msk                 (0xc000000UL)             /*!< PORT15 HWSEL: HW13 (Bitfield-Mask: 0x03)                    */
#define PORT15_HWSEL_HW14_Pos                 (28UL)                    /*!< PORT15 HWSEL: HW14 (Bit 28)                                 */
#define PORT15_HWSEL_HW14_Msk                 (0x30000000UL)            /*!< PORT15 HWSEL: HW14 (Bitfield-Mask: 0x03)                    */
#define PORT15_HWSEL_HW15_Pos                 (30UL)                    /*!< PORT15 HWSEL: HW15 (Bit 30)                                 */
#define PORT15_HWSEL_HW15_Msk                 (0xc0000000UL)            /*!< PORT15 HWSEL: HW15 (Bitfield-Mask: 0x03)                    */



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define PPB_BASE                        0xE000E000UL
#define DLR_BASE                        0x50004900UL
#define ERU0_BASE                       0x50004800UL
#define ERU1_BASE                       0x40044000UL
#define GPDMA0_BASE                     0x500142C0UL
#define GPDMA0_CH0_BASE                 0x50014000UL
#define GPDMA0_CH1_BASE                 0x50014058UL
#define GPDMA0_CH2_BASE                 0x500140B0UL
#define GPDMA0_CH3_BASE                 0x50014108UL
#define GPDMA0_CH4_BASE                 0x50014160UL
#define GPDMA0_CH5_BASE                 0x500141B8UL
#define GPDMA0_CH6_BASE                 0x50014210UL
#define GPDMA0_CH7_BASE                 0x50014268UL
#define FCE_BASE                        0x50020000UL
#define FCE_KE0_BASE                    0x50020020UL
#define FCE_KE1_BASE                    0x50020040UL
#define FCE_KE2_BASE                    0x50020060UL
#define FCE_KE3_BASE                    0x50020080UL
#define PBA0_BASE                       0x40000000UL
#define PBA1_BASE                       0x48000000UL
#define FLASH0_BASE                     0x58001000UL
#define PREF_BASE                       0x58004000UL
#define PMU0_BASE                       0x58000508UL
#define WDT_BASE                        0x50008000UL
#define RTC_BASE                        0x50004A00UL
#define SCU_CLK_BASE                    0x50004600UL
#define SCU_OSC_BASE                    0x50004700UL
#define SCU_PLL_BASE                    0x50004710UL
#define SCU_GENERAL_BASE                0x50004000UL
#define SCU_INTERRUPT_BASE              0x50004074UL
#define SCU_PARITY_BASE                 0x5000413CUL
#define SCU_TRAP_BASE                   0x50004160UL
#define SCU_HIBERNATE_BASE              0x50004300UL
#define SCU_POWER_BASE                  0x50004200UL
#define SCU_RESET_BASE                  0x50004400UL
#define LEDTS0_BASE                     0x48010000UL
#define SDMMC_CON_BASE                  0x500040B4UL
#define SDMMC_BASE                      0x4801C000UL
#define ETH0_CON_BASE                   0x50004040UL
#define ETH0_BASE                       0x5000C000UL
#define ECAT0_CON_BASE                  0x500041B0UL
#define ECAT0_BASE                      0x54010000UL
#define ECAT0_FMMU0_BASE                0x54010600UL
#define ECAT0_FMMU1_BASE                0x54010610UL
#define ECAT0_FMMU2_BASE                0x54010620UL
#define ECAT0_FMMU3_BASE                0x54010630UL
#define ECAT0_FMMU4_BASE                0x54010640UL
#define ECAT0_FMMU5_BASE                0x54010650UL
#define ECAT0_FMMU6_BASE                0x54010660UL
#define ECAT0_FMMU7_BASE                0x54010670UL
#define ECAT0_SM0_BASE                  0x54010800UL
#define ECAT0_SM1_BASE                  0x54010808UL
#define ECAT0_SM2_BASE                  0x54010810UL
#define ECAT0_SM3_BASE                  0x54010818UL
#define ECAT0_SM4_BASE                  0x54010820UL
#define ECAT0_SM5_BASE                  0x54010828UL
#define ECAT0_SM6_BASE                  0x54010830UL
#define ECAT0_SM7_BASE                  0x54010838UL
#define USB0_BASE                       0x50040000UL
#define USB_EP_BASE                   0x50040900UL
#define USB0_EP1_BASE                   0x50040920UL
#define USB0_EP2_BASE                   0x50040940UL
#define USB0_EP3_BASE                   0x50040960UL
#define USB0_EP4_BASE                   0x50040980UL
#define USB0_EP5_BASE                   0x500409A0UL
#define USB0_EP6_BASE                   0x500409C0UL
#define USB0_CH0_BASE                   0x50040500UL
#define USB0_CH1_BASE                   0x50040520UL
#define USB0_CH2_BASE                   0x50040540UL
#define USB0_CH3_BASE                   0x50040560UL
#define USB0_CH4_BASE                   0x50040580UL
#define USB0_CH5_BASE                   0x500405A0UL
#define USB0_CH6_BASE                   0x500405C0UL
#define USB0_CH7_BASE                   0x500405E0UL
#define USB0_CH8_BASE                   0x50040600UL
#define USB0_CH9_BASE                   0x50040620UL
#define USB0_CH10_BASE                  0x50040640UL
#define USB0_CH11_BASE                  0x50040660UL
#define USB0_CH12_BASE                  0x50040680UL
#define USB0_CH13_BASE                  0x500406A0UL
#define USIC0_BASE                      0x40030008UL
#define USIC1_BASE                      0x48020008UL
#define USIC0_CH0_BASE                  0x40030000UL
#define USIC0_CH1_BASE                  0x40030200UL
#define USIC1_CH0_BASE                  0x48020000UL
#define USIC1_CH1_BASE                  0x48020200UL
#define CAN_BASE                        0x48014000UL
#define CAN_NODE0_BASE                  0x48014200UL
#define CAN_NODE1_BASE                  0x48014300UL
#define CAN_MO_BASE                     0x48015000UL
#define VADC_BASE                       0x40004000UL
#define VADC_G0_BASE                    0x40004400UL
#define VADC_G1_BASE                    0x40004800UL
#define DAC_BASE                        0x48018000UL
#define CCU40_BASE                      0x4000C000UL
#define CCU41_BASE                      0x40010000UL
#define CCU40_CC40_BASE                 0x4000C100UL
#define CCU40_CC41_BASE                 0x4000C200UL
#define CCU40_CC42_BASE                 0x4000C300UL
#define CCU40_CC43_BASE                 0x4000C400UL
#define CCU41_CC40_BASE                 0x40010100UL
#define CCU41_CC41_BASE                 0x40010200UL
#define CCU41_CC42_BASE                 0x40010300UL
#define CCU41_CC43_BASE                 0x40010400UL
#define CCU80_BASE                      0x40020000UL
#define CCU80_CC80_BASE                 0x40020100UL
#define CCU80_CC81_BASE                 0x40020200UL
#define CCU80_CC82_BASE                 0x40020300UL
#define CCU80_CC83_BASE                 0x40020400UL
#define PORT0_BASE                      0x48028000UL
#define PORT1_BASE                      0x48028100UL
#define PORT2_BASE                      0x48028200UL
#define PORT3_BASE                      0x48028300UL
#define PORT4_BASE                      0x48028400UL
#define PORT5_BASE                      0x48028500UL
#define PORT14_BASE                     0x48028E00UL
#define PORT15_BASE                     0x48028F00UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

